tutorial.org
* Introduction
Clj-forex is still not released, even as alpha software. However,
to give users a peek at what it is shaping up to be, this tutorial
will attempt to cover the general aspects of programming in clj-forex.

Also, i typed this up quickly, so it is very raw tutorial. 
* Installation
See INSTALL in github

Once installed, you should lein run clj-forex and then
create a new file with the following in it in order to follow
along. This file, for now, should be placed somewhere under the
src directory of the clj-forex github checkout. Alternatively, you can
create a checkouts folder in which you create links to another
project directory. Search for checkout dependencies on this page [[https://github.com/technomancy/leiningen][checkout dependencies]].
Unfortunately, Im not sure if this works for libs that you require in the other checkouts - in fact,
im pretty sure it doesnt. But this is not a problem for this tutorial!.

#+begin_src clojure
(clojure.core/use 'nstools.ns)
(ns+ replace.me.with.ns
     (:clone forex.default) 
     (:use forex.util.general)) 
#+end_src

Take a look at workflow.png on how the workflow looks like - involves emacs! (for now, i will assume you know how to install and setup everything
later i will have more details). 
* Problems
See INSTALL for why it is not released yet
* Usage
** Environment
Clj-forex is first and foremost optimized for convenience. Therefore, there is a global environment which contains often
used parameters, including :period, :symbol, and :i. Therefore, these do not have to be passed into a function. 
#+begin_src clojure
(env) ;;get current enviornment
(env! {:period +h1+ :symbol "USDJPY"}) ;;change current environment
(close) ;;get current close value for USDJPY, period h1
(wenv {:symbol "EURUSD"} (close)) ;;get eurusd close value (see indicator section below)
;;or above could be (close 0 "USDJPY")
(wenv {:symbol "EURUSD" :i 1} (close)) ;;equivalent of (close 1 "USDJPY")
;;WARNING: the above usage of :i will change (im thinking about it ...) - basically, you can use :i in two situations - 
;;when you want to backtest, or when every thing has an offset of 1, and its just more convenient to do a global offset -
;;so im thinking , use :j for the backest and :i for the local offset. 

#+end_src
** Indicators
*** Accessing Indicators
All indicators are, for now, retrieved as arrays from mql4. 
The general standard for the user interface for accessing indicators
is shown below

#accessing/using indicators
#+begin_src clojure
;;if a name starts witih an 'i', this means it will return
;;a vector of length *max*, which is for right now 1000.
;;You should, for now, stick with 1000 because the background
;;thread which updates indicators retrieves each time the 1000 numbers
;;and if you go larger it could slow it down too much. This will change soon
;;as it is clearly only necessary to retrieve, say, the last 10 or so
;;values

(iclose)
(sma 20) (ema 20) (smma 20) (lwma 20)
(iclose "EURUSD" {:period +h1+})
(iclose +h1+ "EURUSD")
(iclose "EURUSD" +h1+)
(iclose {:period +h1+ :symbol "EURUSD"})

(irsi 30) (irsi [30]) 
(irsi 30 "USDJPY" +h1+) ;;retrieve rsi 30 array
(iindicator parameters mode & environment)

;;the above shows 2 different types of accessing
;;the indicator can either have no parameters, 1+ parameters, or
;;1+ parameters and a mode
;;an example of where a mode would be necessary is the stochastic
;;indicator which has multiple lines on it.

;;if a name doesnt start with an i, you must also give it an index. The genereal form is
(indicator parameter mode [i = 0] & environment)
(close) ;;return close at index 0
(close 0)
(rsi 30 11) ;;return rsi 30 indicator at index 11 
(rsi [30] 1111111111111111111111 +h1+) ;;if it is out of bounds, it will return 0

;;also useful is itime and ibarshift - see mql4 docs for what these d
#+end_src
