tutorial.org
*** Accessing Indicators - Behind the Scenes
Take a look at src/forex/module/indicator/map.clj . Basically,
we retrieve indicator from socket if it is not already saved.
If it is saved, we simply access the save copy. In the background,
a thread retrieves the new values of all the indicators that have
been saved and then updates the cache. 
For example

#+begin_src clojure
;;change ns to forex.module.indicator.map
;;retrieve 100 close prices. Theres a tons of defaults used
;;so look at the functions to determine this. 
(indicator-vector {:name "iClose" :param nil :mode 0 :max 100})
#+end_src

The same namespace contains the memoization functions. In shorthand.clj, we
produce macros which follow the standards mentioned previously. In service.clj,
we provide the background thread which updates the indicators. In util.clj, we provide
some utilities, and finally in indicator.clj, we utilize the shorthand macros.

*** Accessing New Indicators
This is great, but how do we access new indicators? For now, we go
to forex.util.mql_indicator_devel.clj. First, we change the 
metatrader-home-dir (probably in the forex_user.clj would be a good
idea, since that is always loaded on lein run). Then, we run
(customize-indicators). Then we recompile commando.mq4. If the indicator names
arent too long, it will compile fine. If they are too long, for now, you'll just have
to delete those indicators. 
Now, once we recompile commando.mq4 and then place it once again on a 
chart, we should be able to access it via the technique shown in the previous
section. And then you can use shorthand.clj macros, show in indicators.clj, to produce
the standard shorthand access!

Now, it is possible to port mql4 indicators to java, automatically. I have
done this by hand, and I barely had to change any of the mql4 code (java and mql4 are
basically the same - minus some static vars, etc.). However, this would be work 
and it is not one of my priorities!

** Account
Various account utilities are available (basically bindings to mql4).
For now, i will redirect you to forex.module.account.utils
Just a taste:
#+begin_src clojure
(account-currency)
(account-company)
(connected?) ;;connected to internet?
(demo?) ;;are we on a demo?
(digit) ;;5 or 4 digit server?
(mode-ask) (mode-bid) (mode-minlot)  
(pip 23) ;; convert 23 pips to point
(point 0.0001) ;;conver to pips
(point) ;;return 0.0001 or 0.01 depending on currency

#+end_src

** Orders
*** Basics
#+begin_src clojure
;;this is all contained in forex.module.account
;;6 types - :buy :sell :buy-stop :sell-stop :sell-limit :buy-limit
(order! {:type :buy :symbol "EURUSD" :tp 1.2 :sl 1.1 :lots (* (mode-minlot) 3)})
(order! {:type :buy :lots 0.03}) ;;use current environment for symbol 
(order! {:type :buy :lots (lot 0.032)}) ;;use 'lot' to round to mode-minlot
(close! order) ;;close all of order
(close! order 0.2) ;;close order, leaving only 0.2 lots left
(modify! order {:sl 0 :tp 2.2}) ;;if sl or tp is zero, this means tp/sl doesnt exist
(delete! order) ;;delete an entry order
(market? order) (entry? order) ;;is it a market or entry order
(sell? order) (buy? order) ;;is the :type in the order a sell or buy?
(open? order) (close? order) ;;is order opened or closed
(order-close-time order)

#+end_src
*** Handling Errors
If an error is produced when manipulating orders, it returns an object of type MqlError. 
#+begin_src clojure
(e? a) ;;is a an error?
;;an error is also counted as equivalent to false
;;also, result is bound to the variable 'it'
(aif (order! {:type :buy :lots 0.2}) it (throwf "arg: an error! %s" it)) 
(aif-not (order! {:type :buy :lots 0.2}) (throwf "arg") it)
;;close to break even and modify tp 
(awhen (-> (modify! order {:tp new-tp :sl (:break order)}) (close! order (lot (/ (:lots order) 2))))
       (println (format "closed order with a spread of %s" (:spread order))))
(awhen-not test then)
#+end_src


Notice, that all order functions accept a MqlError object - if they receive it, they will simply return the same object. This allows
chaining as above (-> (modify! ...) (close! ...)).

In general, errors are handled different ways. If you attempt to access an indicator for the first time, and it cant return
a result, it will throw the Mql error. On the other hand, if it has already been accessed once, since it is now memoized and updated by the background thread, no errors
will be thrown. On the other hand, almost everything else (like mode-ask, account-currency, account-margin,etc.) will thrown the error.
This will be changed before clj-forex is released - the appropriate behavior should be to return the last known value, just like
indicators do. 
