tutorial.html

<div id="outline-container-4_2_2" class="outline-4">
<h4 id="sec-4_2_2"><span class="section-number-4">4.2.2</span> Accessing Indicators - Behind the Scenes </h4>
<div class="outline-text-4" id="text-4_2_2">

<p>Take a look at src/forex/module/indicator/map.clj . Basically,
we retrieve indicator from socket if it is not already saved.
If it is saved, we simply access the save copy. In the background,
a thread retrieves the new values of all the indicators that have
been saved and then updates the cache. 
For example
</p>



<pre class="src src-clojure"><span style="color: #b22222;">;;</span><span style="color: #b22222;">change ns to forex.module.indicator.map
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">retrieve 100 close prices. Theres a tons of defaults used
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">so look at the functions to determine this. 
</span>(indicator-vector {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"iClose"</span> <span style="color: #da70d6;">:param</span> nil <span style="color: #da70d6;">:mode</span> 0 <span style="color: #da70d6;">:max</span> 100})
</pre>



<p>
The same namespace contains the memoization functions. In shorthand.clj, we
produce macros which follow the standards mentioned previously. In service.clj,
we provide the background thread which updates the indicators. In util.clj, we provide
some utilities, and finally in indicator.clj, we utilize the shorthand macros.
</p>
</div>

</div>

<div id="outline-container-4_2_3" class="outline-4">
<h4 id="sec-4_2_3"><span class="section-number-4">4.2.3</span> Accessing New Indicators </h4>
<div class="outline-text-4" id="text-4_2_3">

<p>This is great, but how do we access new indicators? For now, we go
to forex.util.mql<sub>indicator</sub><sub>devel</sub>.clj. First, we change the 
metatrader-home-dir (probably in the forex<sub>user</sub>.clj would be a good
idea, since that is always loaded on lein run). Then, we run
(customize-indicators). Then we recompile commando.mq4. If the indicator names
arent too long, it will compile fine. If they are too long, for now, you'll just have
to delete those indicators. 
Now, once we recompile commando.mq4 and then place it once again on a 
chart, we should be able to access it via the technique shown in the previous
section. And then you can use shorthand.clj macros, show in indicators.clj, to produce
the standard shorthand access!
</p>
<p>
Now, it is possible to port mql4 indicators to java, automatically. I have
done this by hand, and I barely had to change any of the mql4 code (java and mql4 are
basically the same - minus some static vars, etc.). However, this would be work 
and it is not one of my priorities!
</p>
</div>
</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> Account </h3>
<div class="outline-text-3" id="text-4_3">

<p>Various account utilities are available (basically bindings to mql4).
For now, i will redirect you to forex.module.account.utils
Just a taste:
</p>


<pre class="src src-clojure">(account-currency)
(account-company)
(connected?) <span style="color: #b22222;">;;</span><span style="color: #b22222;">connected to internet?
</span>(demo?) <span style="color: #b22222;">;;</span><span style="color: #b22222;">are we on a demo?
</span>(digit) <span style="color: #b22222;">;;</span><span style="color: #b22222;">5 or 4 digit server?
</span>(mode-ask) (mode-bid) (mode-minlot)  
(pip 23) <span style="color: #b22222;">;; </span><span style="color: #b22222;">convert 23 pips to point
</span>(point 0.0001) <span style="color: #b22222;">;;</span><span style="color: #b22222;">conver to pips
</span>(point) <span style="color: #b22222;">;;</span><span style="color: #b22222;">return 0.0001 or 0.01 depending on currency
</span>
</pre>



</div>

</div>

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> Orders </h3>
<div class="outline-text-3" id="text-4_4">


</div>

<div id="outline-container-4_4_1" class="outline-4">
<h4 id="sec-4_4_1"><span class="section-number-4">4.4.1</span> Basics </h4>
<div class="outline-text-4" id="text-4_4_1">




<pre class="src src-clojure"><span style="color: #b22222;">;;</span><span style="color: #b22222;">this is all contained in forex.module.account
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">6 types - :buy :sell :buy-stop :sell-stop :sell-limit :buy-limit
</span>(order! {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:symbol</span> <span style="color: #bc8f8f;">"EURUSD"</span> <span style="color: #da70d6;">:tp</span> 1.2 <span style="color: #da70d6;">:sl</span> 1.1 <span style="color: #da70d6;">:lots</span> (<span style="color: #da70d6;">*</span> (mode-minlot) 3)})
(order! {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:lots</span> 0.03}) <span style="color: #b22222;">;;</span><span style="color: #b22222;">use current environment for symbol 
</span>(order! {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:lots</span> (lot 0.032)}) <span style="color: #b22222;">;;</span><span style="color: #b22222;">use 'lot' to round to mode-minlot
</span>(close! order) <span style="color: #b22222;">;;</span><span style="color: #b22222;">close all of order
</span>(close! order 0.2) <span style="color: #b22222;">;;</span><span style="color: #b22222;">close order, leaving only 0.2 lots left
</span>(modify! order {<span style="color: #da70d6;">:sl</span> 0 <span style="color: #da70d6;">:tp</span> 2.2}) <span style="color: #b22222;">;;</span><span style="color: #b22222;">if sl or tp is zero, this means tp/sl doesnt exist
</span>(delete! order) <span style="color: #b22222;">;;</span><span style="color: #b22222;">delete an entry order
</span>(market? order) (entry? order) <span style="color: #b22222;">;;</span><span style="color: #b22222;">is it a market or entry order
</span>(sell? order) (buy? order) <span style="color: #b22222;">;;</span><span style="color: #b22222;">is the :type in the order a sell or buy?
</span>(open? order) (close? order) <span style="color: #b22222;">;;</span><span style="color: #b22222;">is order opened or closed
</span>(order-close-time order)

</pre>


</div>

</div>

<div id="outline-container-4_4_2" class="outline-4">
<h4 id="sec-4_4_2"><span class="section-number-4">4.4.2</span> Handling Errors </h4>
<div class="outline-text-4" id="text-4_4_2">

<p>If an error is produced when manipulating orders, it returns an object of type MqlError. 
</p>


<pre class="src src-clojure">(e? a) <span style="color: #b22222;">;;</span><span style="color: #b22222;">is a an error?
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">an error is also counted as equivalent to false
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">also, result is bound to the variable 'it'
</span>(aif (order! {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:lots</span> 0.2}) it (throwf <span style="color: #bc8f8f;">"arg: an error! %s"</span> it)) 
(aif-not (order! {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:lots</span> 0.2}) (throwf <span style="color: #bc8f8f;">"arg"</span>) it)
<span style="color: #b22222;">;;</span><span style="color: #b22222;">close to break even and modify tp 
</span>(awhen (<span style="color: #a020f0;">-&gt;</span> (modify! order {<span style="color: #da70d6;">:tp</span> new-tp <span style="color: #da70d6;">:sl</span> (<span style="color: #da70d6;">:break</span> order)}) (close! order (lot (<span style="color: #da70d6;">/</span> (<span style="color: #da70d6;">:lots</span> order) 2))))
       (<span style="color: #da70d6;">println</span> (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"closed order with a spread of %s"</span> (<span style="color: #da70d6;">:spread</span> order))))
(awhen-not test then)
</pre>




<p>
Notice, that all order functions accept a MqlError object - if they receive it, they will simply return the same object. This allows
chaining as above (-&gt; (modify! &hellip;) (close! &hellip;)).
</p>
<p>
In general, errors are handled different ways. If you attempt to access an indicator for the first time, and it cant return
a result, it will throw the Mql error. On the other hand, if it has already been accessed once, since it is now memoized and updated by the background thread, no errors
will be thrown. On the other hand, almost everything else (like mode-ask, account-currency, account-margin,etc.) will thrown the error.
This will be changed before clj-forex is released - the appropriate behavior should be to return the last known value, just like
indicators do. 
</p></div>

</div>
