tutorial.org
*** Map Destructuring/Permanent Storage = Atom-Hash!
What if we want to store an order in a permanent location? Welcome to atom-hash. 
#+begin_src clojure

(def h (atom-hash {:a 2 :b 34}))
(let [{:keys [a b]} h]
  (println (format "got %s and %s" a b))
  ;;this can be done
  (swap! h merge {:a 33})
  ;;or this can be done
  (reset! h {:a 22})
  ;;or this
  (modify! h {:a 22}) ;;this is equivalent to a swap! using merge
  )
#+end_src
So, if you want the order map values to change when you use modify!, you do something like this
#+begin_src clojure
(awhen (order! {:type :buy :lots 0.2})
       (def a (atom-hash it)))
;;or
(def a (order! (atom-hash {:type :buy :lots 0.2 :my-random-paramter 22})))
;;and then
(modify! a {:sl new-sl :my-random-parameter 2222})
a ;;=> sl has been updated if the above was successfull!

#+end_src
The reason swap! and reset! works with atom-hashes is because we change the definition of swap! and reset! to be multimethods
using [[http://onclojure.com/2010/02/17/managing-namespaces/][ns+]]. 

** Eas
TODO - more in depth later \\
For now,  look at one of the examples in forex.exampels (look at forex.examples.timeout-ea).
 Basically, there are four functions, init,start,run, and deinit. Ns to it, and then do (run) to run an ea. A global variable
that has been defined as a var will be copied and bound using binding, so each ea has its own copy. Only atoms, refs, and atom-hashes
are copied - everything else should be persistent. You can customize this copying using a multimethod in the forex.module.ea namespace.

The init function is called at init, run is called every new tick value (well, we sleep 1 second and then look to see if there is a new close value),
and deinit is run once we close. Look at the \*eas\* var to look at all eas. You can query them with (query {:symbol "USDJPY"}). And other stuff ....

** GUI
TODO - more details, less restrictive \\
This is currently very limited - only ONE commando script should be attached to the mql4 chart, and the gui objectss will be
drawn on this. 
For example, this draws some pivot points - 
#+begin_src clojure
(defn pivot-points []
  (wenv {:period +d1+}
	(let [pp (/ (+ (high 1) (low 1) (close 1)) 3)
	      r1 (- (* 2 pp) (low 1))
	      s1 (- (* 2 pp) (high 1))
	      r2 (+ pp (- (high 1) (low 1)))
	      s2 (- pp (- (high 1) (low 1)))
	      r3 (+ (high 1) (* 2 (- pp (low 1))))
	      s3 (- (low 1) (* 2 (- (high 1) pp)))] 
	  (hline pp :name "PP" :color :blue)
	  (hline r1 :name "R1" :color :green)
	  (hline s1 :name "S1" :color :green)
	  (hline r2 :name "R2" :color :red)
	  (hline s2 :name "S2" :color :red)
	  (hline r3 :name "R3" :color :orange)
	  (hline s3 :name "S3" :color :orange))))
#+end_src
* Background Services
Theres 2 background service - the mql4 socket service and the indicator thread update servor. The mql4 socket service
will improve - for example, it makes sense to have a separate socket for each ea (or at least have the option). Enough said !!! ....


