tutorial.html

<div id="outline-container-4_4_3" class="outline-4">
<h4 id="sec-4_4_3"><span class="section-number-4">4.4.3</span> Map Destructuring/Permanent Storage = Atom-Hash! </h4>
<div class="outline-text-4" id="text-4_4_3">

<p>What if we want to store an order in a permanent location? Welcome to atom-hash. 
</p>


<pre class="src src-clojure">(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">h</span> (atom-hash {<span style="color: #da70d6;">:a</span> 2 <span style="color: #da70d6;">:b</span> 34}))
(<span style="color: #a020f0;">let</span> [{<span style="color: #da70d6;">:keys</span> [a b]} h]
  (<span style="color: #da70d6;">println</span> (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"got %s and %s"</span> a b))
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">this can be done
</span>  (<span style="color: #da70d6;">swap!</span> h merge {<span style="color: #da70d6;">:a</span> 33})
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">or this can be done
</span>  (<span style="color: #da70d6;">reset!</span> h {<span style="color: #da70d6;">:a</span> 22})
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">or this
</span>  (modify! h {<span style="color: #da70d6;">:a</span> 22}) <span style="color: #b22222;">;;</span><span style="color: #b22222;">this is equivalent to a swap! using merge
</span>  )
</pre>


<p>
So, if you want the order map values to change when you use modify!, you do something like this
</p>


<pre class="src src-clojure">(awhen (order! {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:lots</span> 0.2})
       (<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">a</span> (atom-hash it)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">or
</span>(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">a</span> (order! (atom-hash {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:lots</span> 0.2 <span style="color: #da70d6;">:my-random-paramter</span> 22})))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">and then
</span>(modify! a {<span style="color: #da70d6;">:sl</span> new-sl <span style="color: #da70d6;">:my-random-parameter</span> 2222})
a <span style="color: #b22222;">;;</span><span style="color: #b22222;">=&gt; sl has been updated if the above was successfull!
</span>
</pre>


<p>
The reason swap! and reset! works with atom-hashes is because we change the definition of swap! and reset! to be multimethods
using <a href="http://onclojure.com/2010/02/17/managing-namespaces/">ns+</a>. 
</p>
</div>
</div>

</div>

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3">4.5</span> Eas </h3>
<div class="outline-text-3" id="text-4_5">

<p>TODO - more in depth later <br/>
For now,  look at one of the examples in forex.exampels (look at forex.examples.timeout-ea).
Basically, there are four functions, init,start,run, and deinit. Ns to it, and then do (run) to run an ea. A global variable
that has been defined as a var will be copied and bound using binding, so each ea has its own copy. Only atoms, refs, and atom-hashes
are copied - everything else should be persistent. You can customize this copying using a multimethod in the forex.module.ea namespace.
</p>
<p>
The init function is called at init, run is called every new tick value (well, we sleep 1 second and then look to see if there is a new close value),
and deinit is run once we close. Look at the \*eas\* var to look at all eas. You can query them with (query {:symbol "USDJPY"}). And other stuff &hellip;.
</p>
</div>

</div>

<div id="outline-container-4_6" class="outline-3">
<h3 id="sec-4_6"><span class="section-number-3">4.6</span> GUI </h3>
<div class="outline-text-3" id="text-4_6">

<p>TODO - more details, less restrictive <br/>
This is currently very limited - only ONE commando script should be attached to the mql4 chart, and the gui objectss will be
drawn on this. 
For example, this draws some pivot points - 
</p>


<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">pivot-points</span> []
  (wenv {<span style="color: #da70d6;">:period</span> +d1+}
        (<span style="color: #a020f0;">let</span> [pp (<span style="color: #da70d6;">/</span> (<span style="color: #da70d6;">+</span> (high 1) (low 1) (close 1)) 3)
              r1 (<span style="color: #da70d6;">-</span> (<span style="color: #da70d6;">*</span> 2 pp) (low 1))
              s1 (<span style="color: #da70d6;">-</span> (<span style="color: #da70d6;">*</span> 2 pp) (high 1))
              r2 (<span style="color: #da70d6;">+</span> pp (<span style="color: #da70d6;">-</span> (high 1) (low 1)))
              s2 (<span style="color: #da70d6;">-</span> pp (<span style="color: #da70d6;">-</span> (high 1) (low 1)))
              r3 (<span style="color: #da70d6;">+</span> (high 1) (<span style="color: #da70d6;">*</span> 2 (<span style="color: #da70d6;">-</span> pp (low 1))))
              s3 (<span style="color: #da70d6;">-</span> (low 1) (<span style="color: #da70d6;">*</span> 2 (<span style="color: #da70d6;">-</span> (high 1) pp)))] 
          (hline pp <span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"PP"</span> <span style="color: #da70d6;">:color</span> <span style="color: #da70d6;">:blue</span>)
          (hline r1 <span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"R1"</span> <span style="color: #da70d6;">:color</span> <span style="color: #da70d6;">:green</span>)
          (hline s1 <span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"S1"</span> <span style="color: #da70d6;">:color</span> <span style="color: #da70d6;">:green</span>)
          (hline r2 <span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"R2"</span> <span style="color: #da70d6;">:color</span> <span style="color: #da70d6;">:red</span>)
          (hline s2 <span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"S2"</span> <span style="color: #da70d6;">:color</span> <span style="color: #da70d6;">:red</span>)
          (hline r3 <span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"R3"</span> <span style="color: #da70d6;">:color</span> <span style="color: #da70d6;">:orange</span>)
          (hline s3 <span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"S3"</span> <span style="color: #da70d6;">:color</span> <span style="color: #da70d6;">:orange</span>))))
</pre>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Background Services </h2>
<div class="outline-text-2" id="text-5">

<p>Theres 2 background service - the mql4 socket service and the indicator thread update servor. The mql4 socket service
will improve - for example, it makes sense to have a separate socket for each ea (or at least have the option). Enough said !!! &hellip;.
</p>

</div>
</div>
<div id="postamble">
<p class="author"> Author: Seth
</p>
<p class="date"> Date: 2011-03-18 07:46:07 CDT</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
